 ## Challenge : Calculate the % Marks for each student. Each subject is of 100 marks. Create a result column by following the below condition

1. % Marks greater than or euqal to 70 then 'Distinction'
 2. % Marks range between 60-69 then 'First Class'
 3. % Marks range between 50-59 then 'Second Class'
 4. % Marks range between 40-49 then 'Third Class'
 5. % Marks Less than or equal to 39 then 'Fail'

In [1]:
# importing required libraries
import pandas as pd

In [2]:
# creating dataframes
students=pd.DataFrame()
students['student_id']=[1,2,3]
students['student_name']=['Steve','David','Aryan']

# creating table marks
marks=pd.DataFrame()
marks['student_id']=[1,1,2,2,3,3]
marks['subject_name']=['pyspark','SQL','SQL','pyspark','SQL','pyspark']
marks['marks']=[90,100,70,60,30,20]

In [3]:
# students table
students

   student_id student_name
0           1        Steve
1           2        David
2           3        Aryan

In [4]:
# marks table
marks

   student_id subject_name  marks
0           1      pyspark     90
1           1          SQL    100
2           2          SQL     70
3           2      pyspark     60
4           3          SQL     30
5           3      pyspark     20

In [5]:
# merging 2 dataframes and storing it, in a variable called data
data=pd.merge(students,marks)
data

   student_id student_name subject_name  marks
0           1        Steve      pyspark     90
1           1        Steve          SQL    100
2           2        David          SQL     70
3           2        David      pyspark     60
4           3        Aryan          SQL     30
5           3        Aryan      pyspark     20

In [6]:
# calculateing percentage of marks
g=data.groupby('student_id')['marks'].sum()/data.groupby('student_id')['subject_name'].count()
g1=pd.DataFrame(g,columns=['percentage_']).reset_index()
g1['percentage_']=g1['percentage_'].astype(int)   # changing dtype

In [7]:
g1.dtypes

student_id     int64
percentage_    int32
dtype: object

In [8]:
# merging g1 dataframe with students data
d=pd.merge(students,g1)
d['result']=0 # creating empty column

In [9]:
# applying conditions 
d.loc[d['percentage_']>=70,['result']]='Distinction'
d.loc[(d['percentage_']>=60) & (d['percentage_']<=69),['result']]='First class'
d.loc[(d['percentage_']>=50) & (d['percentage_']<=59),['result']]='Second class'
d.loc[(d['percentage_']>=40) & (d['percentage_']<=49),['result']]='Third class'
d.loc[d['percentage_']<40,['result']]='Fail'

C:\Users\Charan\AppData\Local\Temp\ipykernel_13960\583785114.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Distinction' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  d.loc[d['percentage_']>=70,['result']]='Distinction'

In [10]:
d  # final output

   student_id student_name  percentage_       result
0           1        Steve           95  Distinction
1           2        David           65  First class
2           3        Aryan           25         Fail